#
# My Brewfile
#
# Install via:
#   cd <this directory>
#   brew bundle
#
# Make sure to keep this up to date!
#
# You can use brew bundle dump to generate an updated Brewfile anywhere and
# diff it against this one.

# My usual list
brew "bash-completion"
brew "direnv"
brew "dos2unix"
brew "git"
brew "jq"
brew "the_silver_searcher"
brew "watch"
brew "pstree"
# For cli MFA support
brew "oath-toolkit"

# Virtual envs
brew "nvm"
brew "pyenv"
# pipenv installed separately

# Emacs
tap "d12frosted/emacs-plus"
brew "d12frosted/emacs-plus/emacs-plus@29", args: ["with-spacemacs-icon"], link: true

# Font required by spacemacs
# tap "homebrew/cask-fonts"
# cask "font-source-code-pro"


# Databases
brew "sqlite"
brew "freetds"
brew "mongocli"
brew "mongosh"
brew "mysql"
brew "mysql-client"
brew "postgresql"
tap "microsoft/mssql-release"
brew "microsoft/mssql-release/msodbcsql17"
brew "microsoft/mssql-release/mssql-tools"

# For Terraform
tap "hashicorp/tap"
brew "tfenv"

# Authing into AWS via jumpcloud
brew "saml2aws"

